# Пользователь вводит предложение (например: "Мама мыла раму"). Программа должна:
#
# Разбить строку на список слов (метод split).
#
# Вывести последнее слово предложения (используя отрицательный индекс).
#
# Создать новый список, где каждое слово написано заглавными буквами (метод upper).
#
# Удалить из исходного списка первое слово (используя pop(0)).
#
# Склеить оставшиеся слова обратно в строку (метод join) и вывести.

# Пример:
#
# Ввод: Мама мыла раму
# Последнее слово: раму
# Заглавные: ['МАМА', 'МЫЛА', 'РАМУ']
# После удаления первого слова: ['мыла', 'раму']
# Строка: мыла раму