# Пример составного логического выражения со скобками в Python может выглядеть так:

a = 5
b = 10

result = (a > 3) and (b < 8) or (a == 4)
print(result)  # Вывод: False

# Пример с использованием скобок
result = ((a > 3) and (b < 8)) or ((a == 4) and (b == 7))
print(result)  # Вывод: False
# Здесь мы определяем переменные a и b, а затем используем эти переменные для создания составного логического выражения.
# Обратите внимание, что во втором примере мы использовали скобки для определения порядка операций.


