# Напишите программу проверяющую, является ли данное слово палиндромом. Палиндром - это слово или фраза,
# которые читаются одинаково в обоих направлениях, например: потоп, шалаш


word = input('Введите слово')
print('Слово наоборот:', word[::-1])