# Компания  планирует добавить два промокода в онлайн-магазин: «sale» и «hello».
#
# Допиши программу, запрашивающую ввод промокода до тех пор, пока не будет введено «sale» или «hello».
# 1. При неверном вводе программа должна снова запросить ввод промокода с подсказкой «Этот промокод недействителен. Попробуйте снова:».
# 2. Когда введён верный промокод, программа должна вывести «Промокод принят.» и завершить работу.
#
# Возможный результат работы программы представлен ниже.

# Введите промокод:>? buy
# Этот промокод недействителен. Попробуйте снова:>? w
# Этот промокод недействителен. Попробуйте снова:>? sale
# Промокод принят.