# Сложение двух чисел
#
# Создайте программу, которая запрашивает у пользователя два числа, преобразует их в тип int, и выводит их сумму.
a = int(input('Введите 1 число'))
b = int(input('Введите 2 число'))
print(a + b)