# Стажёр Иван помогал туркомпании собирать обратную связь.
# Он должен был написать программу, выражающую благодарность клиенту и печатающую длину отзыва.

# Кто-то случайно удалил часть кода. Допиши утраченный фрагмент.



feedback = input('Оставьте отзыв о путешествии:')
length =
print('Спасибо за подробный отзыв! В нём целых', length, 'символов!')