# Создайте две переменные, которые примут численный тип данных. Умножьте их и выведите результат.
num1 = int(input('Число 1: '))
num2 = int(input('Число 2: '))
print(num1 * num2)