# Создайте программу, которая запрашивает у пользователя имя и возраст, а затем выводит сообщение в формате:
# "Меня зовут [имя], мне [возраст] лет." Используйте функции input и print.
name = input('Введите имя: ')
age = input('Введите возраст: ')
print('Меня зовут ' + name + ', мне ' + age + ' лет.')