"""Допишите программу ниже. Она должна запрашивать характеристики вашего питомца, создавать на их основе объект
класса Animal, и печатать характеристики о нём

Пример:

Какой вид вашего животного?>? кот
Какой оно издаёт звук?>? мяу
Как его зовут?>? Кокос
Чем оно питается?>? влажный и сухой корм
Привет! Я кот по имени Кокос, мяу! Моя еда: влажный и сухой корм
"""


class Animal:
    def __init__(self, species, ):
        self.species = species


    def print_info(self):
        print(f'Привет!....')


species = input('Какой вид вашего животного?')
voice =

my_animal =

print_info()
