# Оценка по баллам
# Напишите программу, которая запрашивает у пользователя количество баллов (от 0 до 100)
# и выводит оценку: "A", "B", "C", "D", "F" в зависимости от диапазона баллов.
#
# Пользователь вводит количество баллов.
# Если балл больше либо равен 90, то на экран выводится «Уровень: A».
# Если балл больше либо равен 80, но меньше 90, то «Уровень: B».
# Если балл больше либо равен 70, но меньше 80, то «Уровень: C».
# Если балл больше либо равен 60, но меньше 70, то «Уровень: D».
# Если балл меньше 60, то «Уровень: F».  