# Вывести все числа от 1 до 50, которые делятся на 3.

for i in range(0, 51, 3):
    print(i)