# Напиши программу, запрашивающую ввод горящего сигнала светофора («красный», «жёлтый» или «зелёный»)
# и отрисовывающую светофор с этим горящим сигналом.
# Пример в картинке 5-1, 5-2. Параметры светофора в картинке 5-3


from turtle import *

speed(0)


# def red_light_on():
#     color("red")
#     penup()
#     goto(0, 100)
#     pendown()
#     begin_fill()
#
#
#
# def red_light_off():






# answer = input("Какой горит цвет красный/жёлтый/зелёный?")
# if answer == "красный":
#     red_light_on()

