# Задание - система учёта студентов
# Создать класс Student со свойствами - имя, возраст, факультет, группа
# Список оценок (пуст по умолчанию) и средний балл - два встроенных свойства
# Функция say_hello здоровается и выводит краткую сводку о студенте
# Функция average_marks проверяет есть ли у ученика оценки. Если нет - запрашивает их
# и считает средний балл


class Student:
    """класс описывающий студента"""
    def

    def say_

    average_marks(self):


# создание объекта (экземпляра) класса
st1 = Student('Иван',