# Вывести все числа от 1 до 50, которые делятся на 3.

for i in range(10, 1, -1):
    print(i)