"""Цикл for - второй из возможных двух оператор для создания циклов
в языке python (после while)

Две основные задачи решаемые им:

1) Повтор тела цикла ФИКСИРОВАННОЕ количество раз
2) Перебор элементов последовательности """

for i in 5, 2, 3, 4, 5:
    print(i)

print('\n')
# для переменной i в значениях 5, 2, 3, 4, 5

# Создать ряд чисел в диапазоне:
for i in range(10):
    print(i)

# для i в диапазоне от 0 до 10 НЕ ВКЛЮЧАЯ 10
# число 10 - это аргумент stop

print('\n')

for i in range(2, 10):
    print(i)

print('\n')
# ПО УМОЛЧАНИЮ start = 0, мы передали start = 2

for i in range(2, 10, 2):
    print(i)
print('\n')
# ПО УМОЛЧАНИЮ step = 1, мы передали step = 2

# отрицательный шаг:
for i in range(10, 2, -1):
    print(i)

# иногда удобно вывести в одну строку
print('\n')

for i in range(10):
    print(i, end=' ')
# параметр end отменяет перенос строки и добавляет в конец
# каждого символа указанный параметр
print('\n')
"""если мы не используем счётчик i, можно использовать _"""
for _ in range(3):
    print('Всем привет!')

print('\n')
# если циклы for вложены друг в друга, счётчики надо называть
# по-разному

for i in range(3):
    print(i)
    for j in range(3):
        print(j)


# применение 2 - перебор элементов последовательности

string = 'Я гулял на море, мимо проплывали корабли, солнце садилось'

count_a = 0
for symbol in string:
    if symbol == 'а':
        count_a += 1

print('Букв а в строке:', count_a)

# оператор in проверяет, входит ли элемент последовательность

wrong = '1234567890'
login = input('Введите ваш логин:')
for s in login:
    if s in wrong:
        print('Символ запрещён:', s)

