"""

while - до тех пор, пока
for - для

while удобен, когда мы заранее не знаем сколько раз должен
повториться цикл

"""

# password = input('Введите пароль:')
# while input('Введите пароль:') != 'hello':
#     print('Пароль неверный!')

"""
цикл for удобен в двух случаях:
1) цикл нужно выполнить определённое кол-во раз
2) для перебора элементов последовательности

"""

# for i in 13, 17, 20, 22, 14:
#     print(i >= 16)

# for i in range(2, 10, 3):
#     print(i)

for i in range(10, 2, -1):
    print(i)