# Даны два числа. Если первое число больше второго, выведите на экран “Первое число больше”,
# иначе выведите “Второе число больше либо равно”.
num1 = 250
num2 = 50

if num1 > num2:
    print('Первое число больше')
else:
    print('Второе число больше либо равно')