# Создайте две переменные, которые примут численный тип данных. Умножьте их и выведите результат.
a = 5
b = 1
print(a * b)

