# Магазин игровых девайсов (Скидки и налоги)
# Легенда: Ты пишешь кассовый аппарат для геймерского магазина.
#
# Ввод: Сумма покупки и возраст покупателя.
#
# Условия: * Если возраст от 12 до 18 лет и сумма покупки > 5000 — дарим промокод на следующую игру и скидку 10%.
#
# Если возраст < 12 или сумма покупки > 20000 — дарим фигурку персонажа бесплатно.
#
# В остальных случаях — скидка 0%.
#
# Действие: Рассчитай финальную цену (сумма - скидка) и выведи её. Если покупка совершена ночью
# (введи час от 0 до 23), добавь «ночной налог» 5% к итоговой сумме.