# Напиши программу, которая будет:
#
# 1. Запрашивать ввод фамилии автора.
#
# 2. Если автора в общем перечне нет, то печатать: «Автор не найден!»
#
# 3. Если автор найден, то выводить случайную книгу этого автора (одну из всех в списке).


authors = {
    'Пушкин': ['Сказки', 'Дубровский', 'Руслан и Людмила', 'Капитанская дочка'],
    'Бианки': ['Мышонок Пик', 'Лесная газета', 'Чей нос лучше'],
    'Зощенко': ['Рассказы', 'Голубая книга', 'Лёля и Минька'],
    'Лондон': ['Белый клык', 'Зов предков', 'Мартин Иден'],
    'Заболоцкий': ['Стихи', 'Некрасивая девочка', 'Как мыши с котом воевали'],
    'Кристи': ['Десять негритят', 'Убийство в Восточном экспрессе', 'Труп в библиотеке'],
    'Распутин': ['Уроки французского', 'Дочь Ивана, мать Ивана', 'Рудольфио'],
    'Тургенев': ['Бежин луг', 'Хорь и Калиныч', 'Первая любовь', 'Муму'],
    'Толстой': ['Кавказский пленник', 'Детство', 'Филипок'],
    'Астафьев': ['Конь с розовой гривой', 'Царь-рыба', 'Людочка']
}
