# Программа запрашивает набор оценок ученика через пробел и считает количество пятёрок.
# Зная число пятёрок и число всех оценок, программа может посчитать коэффициент успеваемости ученика.
#
# Пример. Пусть всего 10 оценок, из них 4 пятёрки. Тогда
# идеальность = 4/10*100 = 40 (%).
#
# Напиши программу и оформи её как на примере:

# Введите оценки через пробел:>? 5 2 3 5
# Коэффициент успеваемости (%) - 50.0

marks = input('Введите оценки через пробел:').split()
print(marks)
amount_five = 0
for mark in marks:
    if mark == '5':
        amount_five += 1
result = amount_five/len(marks) * 100
print('Коэффициент успеваемости (%) -', result)
