# Калькулятор с произвольным количеством операций
#
# Вам нужно создать калькулятор, который может выполнять несколько операций над числами.
# Используйте *args для передачи чисел и **kwargs для передачи операций.


# Пример использования
# print("Сумма:", calculator("сумма", 1, 2, 3))  # Вывод: Сумма: 6
# print("Умножение:", calculator("умножение", 2, 3, 4))  # Вывод: Умножение: 24

calculator(operation, *)
    if operation == "сумма":
        return
    elif operation == "умножение":



else:
    return "Неизвестная операция"

